chelogithub/ESP8266/ESP8266_Chelo.c
/*******************************************************************************
*	Codigo de las funciones
*
*	Funciones para utilizar el m�dulo WiFi ESP-8266 AT Commands
*
*	Autor: Marcelo Garcia
*
*******************************************************************************/

#include "string.h"
#include "stdlib.h"
#include "stdio.h"
#include "ESP8266_Chelo.h"
#include "STR_Chelo.h"
#include "ModBUS_Chelo.h"
#include "main.h"




//No se puede quedar esperano en las funciones, hay que detectar a situaci�n y salir del bucle.
//pensar que solo entra cuando recibe datos, si no vuelve a entrar queda ah� eternamentes.
void NOP(struct WIFI *a)
{
	a->_instruccion=0;
	a->_enviaruart=0;
	a->_pasos=0;
}
void Cambiar_CWMODE(struct WIFI *a)
{
	a->_instruccion=1;
	a->_enviaruart=1;
	a->_pasos=0; //210416
}
void ServerTCP(struct WIFI *a)
{
	a->_instruccion=-1;
	a->_enviaruart=1;
	a->_pasos=0; //210416
}
void ConectarWIFI(struct WIFI *a)
{
	a->_instruccion=2;
	a->_enviaruart=1;
	a->_pasos=0; //210416
}
void MUX(struct WIFI *a)
{
	a->_instruccion=4;
	a->_enviaruart=1;
	a->_pasos=0; //210416
}
void IPDef(struct WIFI *a)
{
	a->_instruccion=5;
	a->_enviaruart=1;
	a->_pasos=0; //210416
}
void DesconectarWIFI(struct WIFI *a)
	{
	a->_instruccion=0;
	a->_enviaruart=1;
	a->_pasos=0; //210416
	}
void ConectarTCP(struct WIFI *a)
	{
	a->_instruccion=6;
	a->_enviaruart=1;
	a->_pasos=0; //210416
	}
void CrearServidorTCP(struct WIFI *a)
	{
	a->_instruccion=8;
	a->_enviaruart=1;
	a->_pasos=0; //210416
	}
void EnviarDatosSRVR(struct WIFI *a)
	{
	a->_instruccion=9;
	a->_enviaruart=1;
	a->_pasos=0; //210416
	}
void DesconectarTCP(struct WIFI *a)
	{
	//a->_instruccion=4;
	a->_enviaruart=1;
	a->_pasos=0; //210416
	}
void EnviarDatos(struct WIFI *a)
	{
	a->_instruccion=7;
	a->_enviaruart=1;
	a->_pasos=0; //210416
	}
void Inicializar(struct WIFI *a)
{
a->_WF_Net[32]='\0';				//Nombre de la red WIFI  a conectaraurt
a->_WF_Pass[16]='\0';				//Password de la red WIFI
a->_TCP_Remote_Server_IP[16]='\0';			//IP del Servidor TCP al que me voy a conectar
a->_TCP_Remote_Server_Port[6]='\0';			//Puerto del Servidor TCP al que me voy a conectar
a->_TCP_Local_Server_IP[16]='\0';		//IP del Servidor TCP Local
a->_TCP_Local_Server_Port[6]='\0';		//Puerto del Servidor TCP local
a->_TCP_Local_Server_GWY[16]='\0';		//Gateway de red
a->_TCP_Local_Server_MSK[16]='\0';		//Mascara de red
a->_TCP_Local_Server_Initiated=0;		//Servidor TCP no iniciado
a->_estado=0;					//Estado de m�dulo WIFI
a->_estado_rcv_data=0;			//Estado de Recepcion de datos
a->_dataRCV[384]='\0';			//Data recibida por TCP   SOLO PARA EVITAR SOBREESCRITURA VALOR ORIGINAL 64 RESTRINGIR EN EL .C
a->_data2SND[64]='\0';			//Data a enviar por TCP
a->_uart2snd[384]='\0';			//Datos a enviar por UART
a->_uartRCVD[384]='\0';			//Datos recibidos de UART
a->_uartRCVD_tok[384]='\0';		//Datos recibidos de UART
a->_uartCHrcvd=0;				//Cantidad de caracteres recibidos por la uart
a->_TCPchRCVD=0;				//Caracteres recibidos por TCP
a->_enviaruart=0;				//Envia _uart2snd por puerto serie
a->_pasos=0;					//Pasos por la maquina de estados no se puede manejar como variable local porque hay que almacenarlos cuando entra y sale de la llamada
a->_instruccion=0;				//Funcion que se desea realizar
a->_ejecucion=0;				//Funcion en ejecucion	
a->_okenvio[64]='\0';			//String para enviao de datos, comparacion de enviado y recibido strings variables
a->_ticks=0;
a->_ticks2=0;
a->_debug=0;					//utilizada par fines de debugging
a->_debug_str=0;				//utilizada par fines de debugging
a->_debug_pos=0;				//utilizada par fines de debugging
a->_debug_chrs=0;				//utilizada par fines de debugging
a->_debug_rx_ok=0;
a->_debug_rx_no_ok=0;
a->_debug_SEND_OK=0;
a->_debug_CLOSED=0;
a->_debug_WF_DISCONNECT=0;
a->_debug_FAIL=0;
a->_debug_CONNECT=0;
a->_debug_count=0;				//Cuento la catidad de ipds	
a->_debug_count_old=0;			//Cuento la catidad de ipds
a->_debug_count2=0;				//SEND OK para enviar datos
a->_debug_count3=0;				//SEND OK recuperado de un IPD	
a->_debug_count4=0;				//SEDN OK recibido directo
a->_debug_count5=0;				//Cuento la catidad de ipds	
a->_debug_count6=0;				//Cuento la catidad de ipds	
a->_debug_count7=0;				//Cuento la catidad de ipds
a->_debug_count8=0;				//Cuento la catidad de ipds
a->_debug_count9=0;				//Cuento la catidad de ipds
a->_debug_count10=0;			//Cuento la catidad de ipds
a->_subpaso=0;
}

 // estado no cambia a->estado salvo que dicho estado sea algun valor esperado en la funcion
 //	la recepcion de datos no afecta la variable a->estado, pero puede afectar el registro recibido, en tal caso la funci�n de cae por timeout de rpta a->ticks=5eg
 /*--------------------------------------------------------------*/
int AT_ESP8266_ND( struct WIFI *a )
 {
	 int l3=0, AT_decode=0, estado=0, str=0,chr_pos_fnc=0;
	 char *token;
	 char memstr=' ';
		char comillas='"';
		char separador[]={'"',',','"','\0'};
		char finalizar[]={'"','\r','\n'};
		char separador2[]={'"',','};
		char finalizar2[]={'\r','\n'};
		char vectorcopia[384];
	 //Agregar condicion de falla al conectar strcmp(a->_uartRCVD,"+CWJAP 1\r\n\r\nFAIL\r\n")
	 //a->_estado=0;
//--------BUSCO ERRRORES DE SOLPAMIENTO------------//
int pos=0, pos2=0;
a->_debug_pos=0;
a->_debug_str=strlen(a->_uartRCVD);//str=strlen(a->_uartRCVD)-1;
a->_estado_data=0; //Al entrar, nunca se como se recibió la info

	 a->_uartCHrcvd=strlen(a->_uartRCVD);
//***************************************************************//
//------------------PREGUNTO RECEPCION DE DATOS------------------//
//***************************************************************//

	 // Si tiene datos recibidos los proceso y dejo el vector original

	 a->_n_fcomp=strlen("\r\n+IPD");
	 if (FT_String_ND(a->_uartRCVD,&a->_n_orig,"\r\n+IPD",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)
	 {

	 	a->_n_fcomp=strlen("\r\n+IPD");
	 	//a->_estado_data=0;

	 	if(a->_TCP_Local_Server_EN==0)
	 	{
	 		a->_estado_data=FT_String_ND(a->_uartRCVD,&a->_n_orig,"\r\n+IPD",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,TOKIPDDATA);
	 	}
	 	else
	 	{
	 		a->_estado_data=FT_String_ND(a->_uartRCVD,&a->_n_orig,"\r\n+IPD",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,TOKIPDDATASRVR);
	 	}

	 	if(a->_estado_data==4)
	 	{
	 		a->_estado_rcv_data=99;
	 		a->_n_dataRCV=a->_n_tok;
	 		CopiaVector(a->_dataRCV,a->_uartRCVD_tok,a->_n_tok,0,'A');  //Solo copio la info si es correcta
	 		CopiaVector(a->_data2SND,a->_uartRCVD_tok,5,0,'A');  //Solo copio la info si es correcta

	 		a->_debug_rx_ok++;
	 		a->_new_data_rcv=1;
	 	}
	 	if(a->_estado_data==5)
	 	{
	 		a->_estado_rcv_data=55;
	 		a->_n_dataRCV=0;
	 		a->_debug_rx_no_ok++;
	 		a->_new_data_rcv=1;
	 	}
	 }

	 //--------------------------------------------------------------------------------------------------------------//
	 // 	Arranco preguntando por la sentencia OK, y luego busco otros string dentro de lo recibido     			 //
	 //--------------------------------------------------------------------------------------------------------------//
	 a->_n_fcomp=strlen("OK\r\n");
	if (FT_String_ND(a->_uartRCVD,&a->_n_orig,"OK\r\n",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)
	{

