chelogithub/ESP8266/ESP8266_Chelo.c
			//------------------ENVIADO = RECIBIDO ------------------//
			if (FT_String_ND(a->_uartRCVD,&a->_n_orig,a->_uart2snd,&a->_n_cmp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)//if (strcmp(a->_uartRCVD,a->_uart2snd)==0)//Recibo OK para transmitir
				 {
				 	if (a->_uartRCVD[0] != '\0') //Borro el vector de recepción
				 		{
				 		//AT_decode=10;
				 		a->_n_orig=0;
				 		}
				 	}
			else
			{
			//------------------PAQUETE ENVIADO EN FALLA--------------//
			a->_n_fcomp=strlen("\r\nSEND FAIL\r\n");
			 if (FT_String_ND(a->_uartRCVD,&a->_n_orig,"\r\nSEND FAIL\r\n",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)//if (strcmp(a->_uartRCVD,"\r\nSEND OK\r\n")==0)//Transmision ok
			 	{
			 	 AT_decode=at_tcp_enviado_error;
			 	 a->_debug_FAIL++;
			 	}
			 else
			 {



			//------------------OBTENCI�N DE IP------------------//
			// vienen concatenadas no logra ver el GOT IP se queda en el WIFI CONNECTED
			a->_n_fcomp=strlen("WIFI GOT IP\r\n");
			if (FT_String_ND(a->_uartRCVD,&a->_n_orig,"WIFI GOT IP\r\n",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)//Obtiene IP
				{
					a->_debug_WF_GOTIP++;
					AT_decode=at_wifi_gotip;
				}
			else
			{
				//------------------WIFI CONECTADA------------------//
			a->_n_fcomp=strlen("WIFI CONNECTED");
			if (FT_String_ND(a->_uartRCVD,&a->_n_orig,"WIFI CONNECTED",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)//WIFI CONECTADA
				{
					a->_debug_WF_CNNCTD++;
						 AT_decode=at_wifi_connected;
					//Cuando se cuelga por falla de alimentación queda acá, si es que el módulo
					//llega a responder nuevamnte.
				}
			else
			{

			//------------------CLIENTE TCP CONECTADO------------------//
			a->_n_fcomp=strlen(",CONNECT\r\n");
			if (FT_String_ND(a->_uartRCVD,&a->_n_orig,",CONNECT\r\n",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)//Conectado desde el modulo
				  {
					  AT_decode=at_tcp_client_conectado;
					  a->_debug_CONNECT++;
				  }
			else
			{

			//------------------FALLA------------------//
			a->_n_fcomp=strlen("\r\nFAIL\r\n");
				if (FT_String_ND(a->_uartRCVD,&a->_n_orig,"\r\nFAIL\r\n",&a->_n_fcomp,a->_uartRCVD_tok,&a->_n_tok,&chr_pos_fnc,&a->_id_conn,FIND)==1)//Conectado desde el modulo
				{
					AT_decode=at_fail;
				}
			else
			{



		}}}}}}}}}}
	}

 //Eval�o todo lo recibido desde el puerto serie

		switch (a->_instruccion)
		{
			//--------------------------------------------------------//
			//					Cambiar CWMODE						  //
		    //--------------------------------------------------------//
			case 1:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector
				if(( a->_enviaruart==1)&&(AT_decode!=at_ok)
									   &&(AT_decode!=at_error)
									   &&(AT_decode!=at_restart	)
									   &&(AT_decode!=at_tcp_enviado_ok))//210419 if(( a->_enviaruart==1)&&((a->_estado==1)||(a->_estado>4)))
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando para definir multiples conexiones---------//
						strncat(a->_uart2snd,"AT+CWMODE=1\r\n",strlen("AT+CWMODE=1\r\n"));
						a->_n_uart2SND=strlen(a->_uart2snd);//210418
						a->_estado=100;
						//------Generacion del comando para definir multiples conexiones---------//
						}

				a->_pasos++;

				if (((a->_enviaruart==0)&&((AT_decode==at_ok)||(AT_decode==at_cambiar_modo_ok)
															 ||(AT_decode==at_error)
															 ||(AT_decode==at_restart)
															 ||(AT_decode==at_wifi_connected)
															 ||(AT_decode==at_wifi_gotip)
															 ||(AT_decode==at_tcp_enviado_ok)))
															 ||(a->_ticks > 5000))//210630 Se agrega ATDecode 11 y 12 //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						a->_instruccion=0;	//Finalizo la instrucci�n
						a->_ejecucion=0;
						a->_ticks=0;
					}
					//Reseteo cada vez que entro
			}
			break;
			//--------------------------------------------------------//
			//					Conectar WiFi						  //
		    //--------------------------------------------------------//
			case 2:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector
				if(( a->_enviaruart==1)&&(AT_decode!=at_ok)
									   &&(AT_decode!=at_error)
									   &&(AT_decode!=at_fail)
									   &&(AT_decode!=at_restart)
									   &&(AT_decode!=at_wifi_disconnect)
									   &&(AT_decode!=at_wifi_connected)
									   &&(AT_decode!=at_wifi_gotip))//210419 if(( a->_enviaruart==1)&&((a->_estado==1)||(a->_estado>4)))
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando para conectar---------//
						strncat(a->_uart2snd,"AT+CWJAP=",strlen("AT+CWJAP="));
						strncat(a->_uart2snd,&comillas,1);
						strncat(a->_uart2snd,a->_WF_Net,strlen(a->_WF_Net));
						strncat(a->_uart2snd,separador,strlen(separador));//strncat(a->_uart2snd,separador,3);//
						strncat(a->_uart2snd,a->_WF_Pass,strlen(a->_WF_Pass));
						strncat(a->_uart2snd,finalizar,3);//strncat(a->_uart2snd,finalizar,strlen(finalizar));
						a->_n_uart2SND=strlen(a->_uart2snd);//210418
						a->_estado=200;
						//------Generacion del comando para conectar---------//
						}

				a->_pasos++;

				if (((a->_enviaruart==0)&&((AT_decode==at_ok)||(AT_decode==at_error)
															||(AT_decode==at_fail)
															||(AT_decode==at_restart)
															||(AT_decode==at_wifi_disconnect)
															||(AT_decode==at_wifi_connected)
															||(AT_decode==at_wifi_gotip)))
															||(a->_ticks2 > 20000))  //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						if(AT_decode!=at_wifi_disconnect)
						{
							a->_instruccion=0;	//Para que siga contando por timeout al recibir WIFI DISCONNECT//Finalizo la instrucci�n
							a->_ejecucion=0;
						}

						a->_ticks2=0;
					}

