chelogithub/ESP8266/ESP8266_Chelo.c
			}
			break;
			//--------------------------------------------------------//
			//					Desconectar WiFi					  //
		    //--------------------------------------------------------//
			case 3:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector

				if(( a->_enviaruart==1)&&(AT_decode!=at_restart	)&&(AT_decode!=at_wifi_disconnect)&&(AT_decode!=at_deconectar_ok ))
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando para desconectar---------//
						strncat(a->_uart2snd,"AT+CWQAP\r\n",strlen("AT+CWQAP\r\n"));
						a->_n_uart2SND=strlen(a->_uart2snd);
						//------Generacion del comando para desconectar---------//
						a->_estado=300;
						}

				a->_pasos++;
				if (((a->_enviaruart==0)&&((AT_decode==at_wifi_disconnect)||(AT_decode==at_wifi_connected)||(AT_decode==at_wifi_gotip)||(AT_decode==at_restart	)||(AT_decode==at_deconectar_ok )))||(a->_ticks > 5000))  //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						a->_instruccion=0;	//Finalizo la instrucci�n
						a->_ejecucion=0;
						a->_ticks=0;
					}
					//a->_ticks=0;						//Reseteo cada vez que entro
  		}
			break;
			//--------------------------------------------------------//
			//					Multiples Conexiones     			  //
		    //--------------------------------------------------------//
			case 4:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector

				if(( a->_enviaruart==1)&&(AT_decode!=at_restart	)
									   &&(AT_decode!=at_ok)
									   &&(AT_decode!=at_error))
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando para desconectar---------//
						if(a->_TCP_Local_Server_EN==1)
						{
							strncat(a->_uart2snd,"AT+CIPMUX=1\r\n",strlen("AT+CIPMUX=1\r\n"));
						}
						else
						{
							strncat(a->_uart2snd,"AT+CIPMUX=0\r\n",strlen("AT+CIPMUX=0\r\n"));
						}
						a->_n_uart2SND=strlen(a->_uart2snd);
						//------Generacion del comando para desconectar---------//
						a->_estado=400;
						}

				a->_pasos++;
				if (((a->_enviaruart==0)&&((AT_decode==at_ok)||(AT_decode==at_wifi_connected)
															||(AT_decode==at_wifi_gotip)
															||(AT_decode==at_restart)
															||(AT_decode==at_error)
															||(AT_decode==at_multiple_conn_ok)
															||(AT_decode==at_no_multiple_conn_ok)
															||(AT_decode==at_multiple_conn_err)
															||(AT_decode==at_no_multiple_conn_err)))
															||(a->_ticks > 5000))  //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						a->_instruccion=0;	//Finalizo la instrucci�n
						a->_ejecucion=0;
						a->_ticks=0;
					}
					//a->_ticks=0;						//Reseteo cada vez que entro
  		}
			break;
			//--------------------------------------------------------//
			//					Especificar IP           			  //
		    //--------------------------------------------------------//
			case 5:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector

				if(( a->_enviaruart==1)&&(AT_decode!=at_restart)
									   &&(AT_decode!=at_ok)
									   &&(AT_decode!=at_error)
									   &&(AT_decode!=at_def_ip_err)
									   &&(AT_decode!=at_def_ip_ok))
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando para desconectar---------//
						strncat(a->_uart2snd,"AT+CIPSTA=",strlen("AT+CIPSTA="));
						strncat(a->_uart2snd,&comillas,1);
						strncat(a->_uart2snd,a->_TCP_Local_Server_IP,strlen(a->_TCP_Local_Server_IP));
						strncat(a->_uart2snd,separador,3);
						strncat(a->_uart2snd,a->_TCP_Local_Server_GWY,strlen(a->_TCP_Local_Server_GWY));
						strncat(a->_uart2snd,separador,3);
						strncat(a->_uart2snd,a->_TCP_Local_Server_MSK,strlen(a->_TCP_Local_Server_MSK));
						strncat(a->_uart2snd,&comillas,1);
						strncat(a->_uart2snd,finalizar2,2);//strncat(a->_uart2snd,finalizar2,strlen(finalizar2));

						a->_n_uart2SND=strlen(a->_uart2snd);
						//------Generacion del comando para desconectar---------//
						a->_estado=500;
						}

				a->_pasos++;
				if (((a->_enviaruart==0)&&((AT_decode==at_ok)||(AT_decode==at_wifi_connected)
															 ||(AT_decode==at_wifi_gotip)
															 ||(AT_decode==at_restart)
															 ||(AT_decode==at_error)
															 ||(AT_decode==at_def_ip_err)
															 ||(AT_decode==at_def_ip_ok)))
															 ||(a->_ticks > 5000))  //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						a->_instruccion=0;	//Finalizo la instrucci�n
						a->_ejecucion=0;
						a->_ticks=0;
					}
					//a->_ticks=0;						//Reseteo cada vez que entro
  		}
			break;
			//--------------------------------------------------------//
			//					Conectar a TCP Server    			  //
		    //--------------------------------------------------------//
			case 6:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector

				if(( a->_enviaruart==1)&&(AT_decode!=at_wifi_connected)
									   &&(AT_decode!=at_wifi_gotip)
									   &&(AT_decode!=at_tcp_alrdy_cnntd_err)
									   &&(AT_decode!=at_tcp_conectado)
									   &&(AT_decode!=at_tcp_desconectado)
									   &&(AT_decode!=at_error))
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando ---------//
						strncat(a->_uart2snd,"AT+CIPSTART=",strlen("AT+CIPSTART="));
						strncat(a->_uart2snd,&comillas,1);
						strncat(a->_uart2snd,"TCP",strlen("TCP"));
						strncat(a->_uart2snd,separador,3);
						strncat(a->_uart2snd,a->_TCP_Remote_Server_IP,strlen(a->_TCP_Remote_Server_IP));
						strncat(a->_uart2snd,separador2,2);
						strncat(a->_uart2snd,a->_TCP_Remote_Server_Port,strlen(a->_TCP_Remote_Server_Port));
						strncat(a->_uart2snd,finalizar2,strlen(finalizar2));
						a->_n_uart2SND=strlen(a->_uart2snd);
						a->_estado=600;
						//------Generacion del comando ---------//
						}

