chelogithub/ESP8266/ESP8266_Chelo.c
				a->_pasos++;
				if (((a->_enviaruart==0)&&((AT_decode==at_wifi_disconnect)||(AT_decode==at_wifi_connected)
																		  ||(AT_decode==at_wifi_gotip)
																		  ||(AT_decode==at_tcp_alrdy_cnntd_err)
																		  ||(AT_decode==at_tcp_conectado)
																		  ||(AT_decode==at_tcp_desconectado)
																		  ||(AT_decode==at_error)))
																		  ||(a->_ticks > 5000))//210419 if (((a->_enviaruart==0)&&((estado==5)||(estado==6)||(estado==7)||(estado==13)||(estado==14)))||(a->_ticks > 5000))  //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						a->_instruccion=0;	//Finalizo la instrucci�n
						a->_ejecucion=0;
						a->_ticks=0;
					}
					//a->_ticks=0;						//Reseteo cada vez que entro
			}
			break;
			//--------------------------------------------------------//
			//			   Enviar datos a TCP Server    			  //
		    //--------------------------------------------------------//
			case 7:
			{
					unsigned char caracteres[8]="";



				if((AT_decode==at_tcp_desconectado)||(AT_decode==at_wifi_disconnect))
				{
					a->_estado=AT_decode;
					a->_instruccion=0;		//Finalizo la instrucci�n
					a->_ejecucion=0;
					a->_subpaso=0;
				}
				else
				{
							if( (a->_enviaruart==1)&&(a->_subpaso==0))
								{
										a->_ejecucion=1;
										a->_estado=24;
										a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector
										a->_subpaso++;					//Asigno para que no vuelva a entrar
										a->_pasos=0;
										a->_okenvio[0]='\0';	  //Borro el vector a->_okenvio
										//------Generacion del comando ---------//
		// El problema está al enviar el caracater nulo, se deben contar los caracteres nulo del vector uart2nd, o bien informar
		//la cantidad de datos a enviar, es posible recorrer todo el vector con un while y contar hasta el ultimo dato (que lo detecte
										//------Generacion del comando ---------//
										strncat(a->_uart2snd,"AT+CIPSEND=",strlen("AT+CIPSEND="));
										INTOA(a->_n_D2SND, caracteres);	//INTOA(strlen(a->_data2SND), caracteres);		        //Longitud  de datos a enviar
										//STRNACT_ADV(a->_uart2snd,strlen("AT+CIPSEND="),caracteres,strlen(caracteres));
										strncat(a->_uart2snd,caracteres,strlen(caracteres));//strncat(a->_uart2snd,caracteres,strlen(caracteres));//AT+CIPSEND="cdad caracteres"
										strcpy(a->_okenvio,a->_uart2snd);
										strncat(a->_uart2snd,finalizar2,2);//strncat(a->_uart2snd,finalizar2,strlen(finalizar2));
										a->_n_uart2SND=strlen(a->_uart2snd);
										strncat(a->_okenvio,"\r\r\n\r\nOK\r\n> ",strlen("\r\r\n\r\nOK\r\n> "));
										a->_debug_count3++;
										a->_estado=700;
										//------Generacion del comando ---------//
								}

								a->_pasos++;

							if ((a->_enviaruart==0)&&(AT_decode!=at_tcp_enviado_ok)
												   &&((strcmp(a->_uartRCVD,a->_okenvio)==0)||(AT_decode==at_ok)
														   	   	   	   	   	   	   	   	   ||(AT_decode==at_tcp_ok_to_send)
																						   ||((a->_ticks > 5000)&&(a->_subpaso==1))))
							{//---------------------------------------------------Env�o el dato
								if(a->_ticks > 5000)//if((a->_ticks > 5000)||(a->_subpaso==1))//((a->_ticks > 5000)&&(a->_subpaso==1))
								{
									a->_debug_count7++;//-----------------------------Cuento los que entran por timeout
								}
								a->_debug_count4++;
								a->_subpaso++;
								a->_enviaruart=1;
								CopiaVector(a->_uart2snd,a->_data2SND,a->_n_D2SND,1,'a');//strcpy(a->_uart2snd,a->_data2SND);
								a->_n_uart2SND=a->_n_D2SND; //Asigno cantidad de elementos del vector
								a->_ticks=0;//----------------------------------Evito que entre de toque en el siguiente
							}

							if((a->_estado==700)&&((AT_decode==at_tcp_enviado_ok)||(a->_ticks > 5000)
																				 ||(AT_decode==at_wifi_disconnect)
																				 ||(AT_decode==at_wifi_connected)
																				 ||(AT_decode==at_wifi_gotip)
																				 ||(AT_decode==at_tcp_desconectado)
																				 ||(AT_decode==at_tcp_snd_err)
																				 ||(AT_decode==at_tcp_enviado_error)))
								{
									a->_debug_count5++;
									if(a->_ticks > 5000)
									{
										a->_debug_count8++;
										a->_subpaso++;
										a->_ticks=0;
									}

									if((a->_subpaso > 2)&&(AT_decode!=at_tcp_desconectado)&&(AT_decode!=at_wifi_disconnect))//--------------No considero los etados de fallas por TCP o WIFI caido
									{
										a->_estado=15;//-----------------------------Error de Env�o TCP
									}
									else
									{
										a->_estado=AT_decode;	//Devuelvo el estado
									}
									a->_instruccion=0;		//Finalizo la instrucci�n
									a->_ejecucion=0;
									a->_subpaso=0;
								}
				}
					//a->_ticks=0;						//Reseteo cada vez que entro
			}
			break;
			//--------------------------------------------------------//
			//					Crear Local TCP Server    			  //
		    //--------------------------------------------------------//
			case 8:
			{
				a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector

				if( a->_enviaruart==1)
						{
						a->_pasos=0;
						a->_ejecucion=1;
						//------Generacion del comando ---------//
						strncat(a->_uart2snd,"AT+CIPSERVER=1,",strlen("AT+CIPSERVER=1,"));
						strncat(a->_uart2snd,a->_TCP_Local_Server_Port,strlen(a->_TCP_Local_Server_Port));
						strncat(a->_uart2snd,finalizar2,strlen(finalizar2));
						a->_n_uart2SND=strlen(a->_uart2snd);
						a->_estado=800;
						//------Generacion del comando ---------//
						}
				a->_pasos++;
				if (((a->_enviaruart==0)&&((AT_decode==at_wifi_disconnect)||(AT_decode==at_wifi_connected)||(AT_decode==at_wifi_gotip)||(AT_decode==at_tcp_alrdy_cnntd_err)||(AT_decode==at_tcp_conectado)||(AT_decode==at_tcp_desconectado)||(AT_decode==21)||(AT_decode==22)||(AT_decode==23)))||(a->_ticks > 5000))//210419 if (((a->_enviaruart==0)&&((estado==5)||(estado==6)||(estado==7)||(estado==13)||(estado==14)))||(a->_ticks > 5000))  //Que analice luego de enviar por uart
					{
						a->_estado=AT_decode;	//Devuelvo el estado WIFI Conectada
						a->_instruccion=0;	//Finalizo la instrucci�n
						a->_ejecucion=0;
						a->_ticks=0;
					}
			}
			break;
			//--------------------------------------------------------//
			//			   Enviar datos desde TCP Server    			  //
		    //--------------------------------------------------------//
			case 9:
			{
					unsigned char caracteres[8]="";

