chelogithub/ESP8266/ESP8266_Chelo.c
					if((AT_decode==at_tcp_desconectado)||(AT_decode==at_wifi_disconnect))
				{
					a->_estado=AT_decode;
					a->_instruccion=0;		//Finalizo la instrucci�n
					a->_ejecucion=0;
					a->_subpaso=0;
				}
				else
				{
							if( (a->_enviaruart==1)&&(a->_subpaso==0))
								{
										a->_ejecucion=1;
										a->_estado=24;
										a->_uart2snd[0]='\0';		//En teor�a borro lo que tenga el vector
										a->_subpaso++;					//Asigno para que no vuelva a entrar
										a->_pasos=0;
										a->_okenvio[0]='\0';	  //Borro el vector a->_okenvio
										//------Generacion del comando ---------//
		// El problema está al enviar el caracater nulo, se deben contar los caracteres nulo del vector uart2nd, o bien informar
		//la cantidad de datos a enviar, es posible recorrer todo el vector con un while y contar hasta el ultimo dato (que lo detecte
										//------Generacion del comando ---------//
										strncat(a->_uart2snd,"AT+CIPSEND=",strlen("AT+CIPSEND="));//strncat(a->_uart2snd,"AT+CIPSEND=0,",strlen("AT+CIPSEND=0,"));
										INTOA(a->_id_conn, caracteres);
										strncat(a->_uart2snd,caracteres,strlen(caracteres));
										strncat(a->_uart2snd,",",1);
										INTOA(a->_n_D2SND, caracteres);	//INTOA(strlen(a->_data2SND), caracteres);		        //Longitud  de datos a enviar
										strncat(a->_uart2snd,caracteres,strlen(caracteres));//strncat(a->_uart2snd,caracteres,strlen(caracteres));//AT+CIPSEND="cdad caracteres"
										strcpy(a->_okenvio,a->_uart2snd);
										strncat(a->_uart2snd,finalizar2,2);//strncat(a->_uart2snd,finalizar2,strlen(finalizar2));
										a->_n_uart2SND=strlen(a->_uart2snd);
										strncat(a->_okenvio,"\r\r\n\r\nOK\r\n> ",strlen("\r\r\n\r\nOK\r\n> "));
										a->_debug_count3++;
										a->_estado=900;
										//------Generacion del comando ---------//
								}

								a->_pasos++;

							if ((a->_enviaruart==0)&&(AT_decode!=at_tcp_enviado_ok)&&((strcmp(a->_uartRCVD,a->_okenvio)==0)||(AT_decode==at_ok)||(AT_decode==20)||((a->_ticks > 5000)&&(a->_subpaso==1))))
							{//---------------------------------------------------Env�o el dato
								if((a->_ticks > 5000)&&(a->_subpaso==1))
								{
									a->_debug_count7++;//-----------------------------Cuento los que entran por timeout
								}
								a->_debug_count4++;
								a->_subpaso++;
								a->_enviaruart=1;
								CopiaVector(a->_uart2snd,a->_data2SND,a->_n_D2SND,1,'a');//strcpy(a->_uart2snd,a->_data2SND);
								a->_n_uart2SND=a->_n_D2SND; //Asigno cantidad de elementos del vector
								a->_ticks=0;//----------------------------------Evito que entre de toque en el siguiente
							}

							if((a->_estado==900)&&((AT_decode==at_tcp_enviado_ok)||(AT_decode==at_wifi_connected)||(AT_decode==at_wifi_gotip)||(a->_ticks > 5000)||(AT_decode==at_wifi_disconnect)||(AT_decode==at_tcp_desconectado)||(AT_decode==at_tcp_snd_err)||(AT_decode==at_tcp_enviado_error)||(AT_decode==22)||(AT_decode==25)))
								{
									a->_debug_count5++;
									if(a->_ticks > 5000)
									{
										a->_debug_count8++;
										a->_subpaso++;
										a->_ticks=0;
									}

									if((a->_subpaso > 2)&&(AT_decode!=at_tcp_desconectado)&&(AT_decode!=at_wifi_disconnect))//--------------No considero los etados de fallas por TCP o WIFI caido
									{
										//a->_estado=15;//-----------------------------Error de Env�o TCP
										//No tengo definido el estado
									}
									else
									{
										a->_estado=AT_decode;	//Devuelvo el estado
									}
									a->_instruccion=0;		//Finalizo la instrucci�n
									a->_ejecucion=0;
									a->_subpaso=0;
								}
				}
					//a->_ticks=0;						//Reseteo cada vez que entro
			}
			break;
			default:		//Si no hay instruccion paso el estado a la estructura
			{
				a->_estado=AT_decode;
			}
			break;
		}


		a->_uartRCVD[0]='\0'; //200829  Elimino el registro de recepcion, solo se vuelve a actualizar en TIMEOUT
		a->_n_orig=0;

		return (a->_estado);

 }
 // estado no cambia a->estado salvo que dicho estado sea algun valor esperado en la funcion
 //	la recepcion de datos no afecta la variable a->estado, pero puede afectar el registro recibido, en tal caso la funci�n de cae por timeout de rpta a->ticks=5eg
 /*--------------------------------------------------------------*/
 void AT_Enviar_String( char *B , char *D, char *E)
 {
	int el=0, b=0;
	int a=strlen(B); //Obtengo la cantidad de caracteres de la info
	char string_envio[15]="AT+CIPSEND=";
	char string_envio2[]={""};
	b=INTOA(a, string_envio2);

	strncat(string_envio,string_envio2,strlen(string_envio2));

	while (el< strlen(string_envio))
	{
		*D++=string_envio[el];
		*E++=string_envio[el];
		el++;
	}
	  *D++=0x0D;
	  *D++=0x0A;
	  *E++=0x0D;
		*E++=0x0D;
		*E++=0x0A;
		*E++=0x0D;
		*E++=0x0A;
		*E++='O';
		*E++='K';
		*E++=0x0D;
		*E++=0x0A;
		*E++='>';
		*E++=0x20;

 }
 /*--------------------------------------------------------------*/

		//--------------Maquina de estados para conectar a TCP
int WiFi_Conn_ND( struct WIFI *b, UART_HandleTypeDef *PORTSER, int EN_DEBUG )
{
		switch (b->_estado_conexion)
		{
			case CAMBIAR_MODO_EN_CURSO:			//WIFI Desconectado --> Conectar a WIFI nuevamente
			{
				if((b->_estado!=100)&&(b->_estado!=at_ok)
									&&(b->_estado!=at_cambiar_modo_ok)
									&&(b->_estado!=at_error)
									&&(b->_estado!=at_restart)
									&&(b->_estado!=at_tcp_enviado_ok))	//Si estoy conectando, no vuelvo a conectar.
				{
						Cambiar_CWMODE(b);
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);  //Genero las instrucciones a enviar
								b->_enviaruart=0;
								if (EN_DEBUG==1)
								{
									ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								}else{}
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);
							}
						else{}
				}
				else
				{
					//----Condiciones de cambio de estado
					if((b->_estado==at_ok)||
					   (b->_estado==at_cambiar_modo_ok))
						{
						b->_estado_conexion=CAMBIAR_MODO_OK; 	//Cambio de estado exitoso
						}

					if((b->_estado==at_error)||(b->_estado==at_restart)
											 ||(b->_estado==at_wifi_connected)
											 ||(b->_estado==at_wifi_gotip))
						{
						b->_estado_conexion=CAMBIAR_MODO_ERROR; //210630 Se agrega ATDecode 4, 11 y 12	//Cambio de estado erroneo
						}
					//----Condiciones de cambio de estado
				}
			}
			break;
			case CAMBIAR_MODO_ERROR://Error al cambiar de modo
			{
				Cambiar_CWMODE(b);
				b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
				b->_estado=0;
				b->_n_orig=0; //Borro el vector RX

