chelogithub/ESP8266/ESP8266_Chelo.c
				b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
			}
			break;
			case CAMBIAR_MODO_OK ://Cambio de modo OK
			{
//220818
				if (b->_TCP_Local_Server_EN)//
				{//
					MUX(b);	//								//Si me conecté seteo las múltiples Conexiones
					b->_estado_conexion=MUX_CONN_EN_CURSO;//
					b->_estado=0;//

				}//
				else//
				{//
					ConectarWIFI(b);
					b->_estado_conexion=CONEXION_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}//

				if(b->_estado==at_restart)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;

						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
			}
			break;
			case CONEXION_EN_CURSO:			//WIFI Desconectado --> Conectar a WIFI nuevamente
			{
				if((b->_estado!=200)&&((b->_estado!=at_ok)
									&&(b->_estado!=at_error)
									&&(b->_estado!=at_fail)
									&&(b->_estado!=at_restart)
						            &&(b->_estado!=at_wifi_disconnect)
									&&(b->_estado!=at_wifi_connected)
									&&(b->_estado!=at_wifi_gotip)))	//Si estoy conectando, no vuelvo a conectar.
				{
						ConectarWIFI(b);
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);
							}
				}

				//----Condiciones de cambio de estado
				if((b->_estado==at_ok)||(b->_estado==at_wifi_gotip))

					{
						b->_estado_conexion=CONEXION_OK; 	//Ya puedo pedir conexi�n TCP
					}
				if((b->_estado==at_error)||(b->_estado==at_fail)||(b->_estado==at_conn_wifi_err)) b->_estado_conexion=CONEXION_ERROR; 	//Ya puedo pedir conexi�n TCP
				//----Condiciones de cambio de estado
			}
			break;
			case CONEXION_ERROR://Error al conectar
			{
				HAL_Delay(5000); //Cuando entrega el error, lo hace rápido no demora.
				//--------------------------------------------------------------------------------------//
				// Al arrojar error la rutina vuelve a pedir conexion, normalmente el módulo			//
				// tarda en realizar el proceso de conexión cuando AT+CWMODE=1, si AT+CWMODE=2			//
				// el módulo de la respuesta inmediata de error al querer conectar, geberando un		//
				// bucle infinito de ERRORES al querer conectar.										//
				// La unica manera de solucionarlo es seteando nuevamente AT+CWMODE=1					//
				// La realidad es que es muy dificil que se borre la flash una vez inciado el módulo	//
				// se le podría dar un tratamiento pero de momento no lo haremos salvo que sea necesario//
				//--------------------------------------------------------------------------------------//
				ConectarWIFI(b);
				b->_estado_conexion=CONEXION_EN_CURSO;
				b->_estado=0;
				b->_n_orig=0; //Borro el vector RX
				if(b->_estado==at_restart	)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;

						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
			}
			break;
			case CONEXION_OK://Conecta OK
			{
				b->_n_orig=0; //Borro el vector RX

				if(b->_TCP_Local_Server_Initiated==1)  //Si el servidor ya estaba iniciado, voy al servidor inciado
				{
					b->_estado_conexion=TCP_SRVR_OK ;
					b->_estado=0;
				}

				if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok)) //Si me desconecto, me vuelvo a conectar
				{
					ConectarWIFI(b);
					b->_estado_conexion=CONEXION_EN_CURSO;
					b->_estado=0;
				}

				if(b->_estado==at_restart	)					  //Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;
						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
//220818
				if(b->_TCP_Local_Server_EN)//
				{//
					CrearServidorTCP(b);
					b->_estado_conexion=TCP_SRVR_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}//
				else//
				{//
					MUX(b);									//Si me conecté seteo las múltiples Conexiones
					b->_estado_conexion=MUX_CONN_EN_CURSO;
					b->_estado=0;
				}//
			}
			break;
			case DESCONEXION_EN_CURSO:			//Desconectar WiFi
			{
				if((b->_estado!=300)&&(b->_estado!=at_restart)&&(b->_estado!=at_wifi_disconnect)&&(b->_estado!=at_deconectar_ok ))	//Si estoy conectando, no vuelvo a conectar.
				{
						DesconectarWIFI(b);
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);

							}
				}

				//----Condiciones de cambio de estado
				if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) b->_estado_conexion=DESCONEXION_OK; 	//Ya puedo pedir conexi�n TCP
				//----Condiciones de cambio de estado
			}
			break;
			case DESCONEXION_ERROR ://Error al Desconectar WiFi
			{
				NOP(b);
			}
			break;
			case DESCONEXION_OK ://Desconectar WiFi OK
			{
				b->_n_orig=0; //Borro el vector RX

				ConectarWIFI(b);
				b->_estado_conexion=CONEXION_EN_CURSO;
				b->_estado=0;

					if(b->_estado==at_restart	)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;


						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
			}
			break;
			case MUX_CONN_EN_CURSO:			//Multiples Conexiones
			{
				if((b->_estado!=400)&&(b->_estado!=at_restart)
									&&(b->_estado!=at_ok)
									&&(b->_estado!=at_error)
									&&(b->_estado!=at_multiple_conn_ok)
						            &&(b->_estado!=at_no_multiple_conn_ok)
									&&(b->_estado!=at_multiple_conn_err)
									&&(b->_estado!=at_no_multiple_conn_err))	//Si estoy conectando, no vuelvo a conectar.
				{
						MUX(b);
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


