chelogithub/ESP8266/ESP8266_Chelo.c
							}
				}

				//----Condiciones de cambio de estado
				if((b->_estado==at_ok)||(b->_estado==at_multiple_conn_ok)||(b->_estado==at_no_multiple_conn_ok)) b->_estado_conexion=MUX_CONN_OK;
				if((b->_estado==at_error)||(b->_estado==at_multiple_conn_err)||(b->_estado==at_no_multiple_conn_err)) b->_estado_conexion=MUX_CONN_ERROR;
				//----Condiciones de cambio de estado
			}
			break;
			case MUX_CONN_ERROR://Error Multiples Conexiones
			{
				NOP(b);
				if(b->_estado==at_restart)		//Reinicio involuntario de módulo
				{
					Cambiar_CWMODE(b);
					b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX

					b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
				}
				if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
				{
					ConectarWIFI(b);
					b->_estado_conexion=CONEXION_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}
			}
			break;
			case MUX_CONN_OK://Multiples Conexiones OK
			{
				NOP(b);
				b->_n_orig=0; //Borro el vector RX

					if(b->_estado==at_restart)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;

						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
					if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
					{
						ConectarWIFI(b);
						b->_estado_conexion=CONEXION_EN_CURSO;
						b->_estado=0;
					}

					IPDef(b);
					b->_estado_conexion=DEF_IP_EN_CURSO;
					b->_estado=0;
			}
			break;
			case DEF_IP_EN_CURSO:			//Definir IP
			{
				if((b->_estado!=500)&&(b->_estado!=at_restart)
									&&(b->_estado!=at_ok)
									&&(b->_estado!=at_error)
									&&(b->_estado!=at_def_ip_ok)
									&&(b->_estado!=at_def_ip_err))	//Si estoy conectando, no vuelvo a conectar.
				{
						IPDef(b);
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


							}
				}

				//----Condiciones de cambio de estado
				if((b->_estado==at_ok)||(b->_estado==at_def_ip_ok)) b->_estado_conexion=DEF_IP_OK;
				if((b->_estado==at_error)||(b->_estado==at_def_ip_err)) b->_estado_conexion=DEF_IP_ERROR;
				//----Condiciones de cambio de estado
			}
			break;
			case DEF_IP_ERROR://Error Definir IP
			{
				NOP(b);
				if((b->_estado==at_restart)||(b->_estado==at_error))		//Reinicio involuntario de módulo
				{
					Cambiar_CWMODE(b);
					b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX

					b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
				}
				if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
				{
					ConectarWIFI(b);
					b->_estado_conexion=CONEXION_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}
			}
			break;
			case DEF_IP_OK://Definir IP OK
			{
				NOP(b);

					if(b->_estado==at_restart)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX

						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
					if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
					{
						ConectarWIFI(b);
						b->_estado_conexion=CONEXION_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX
					}

//220818 lo anulado esta presente, para volver atras descomentar

					if (b->_TCP_Local_Server_EN==0)
					{
						ConectarTCP(b);
						b->_estado_conexion=TCP_CONN_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX
					}
					else
					{
						ConectarWIFI(b);//
						b->_estado_conexion=CONEXION_EN_CURSO;//
						b->_estado=0;//
						b->_n_orig=0;// //Borro el vector RX
						//CrearServidorTCP(b);
						//b->_estado_conexion=TCP_SRVR_EN_CURSO;
						//b->_estado=0;
						//b->_n_orig=0; //Borro el vector RX
					}
			}
			break;
			case TCP_CONN_EN_CURSO:			//Conectar a Servidor TCP
			{
				if((b->_estado!=600)&&(b->_estado!=at_error)
									&&(b->_estado!=at_ok)
									&&(b->_estado!=at_wifi_disconnect)
									&&(b->_estado!=at_tcp_alrdy_cnntd_err)
									&&(b->_estado!=at_tcp_conectado)
									&&(b->_estado!=at_tcp_desconectado))	//Si estoy conectando, no vuelvo a conectar.
				{
					ConectarTCP(b);
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


							}
				}

				//----Condiciones de cambio de estado
				if((b->_estado==at_ok)||(b->_estado==at_tcp_alrdy_cnntd_err)||(b->_estado==at_tcp_conectado))
					{
					b->_estado_conexion=TCP_CONN_OK;
					}
				else
				{
					if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado)) b->_estado_conexion=TCP_CONN_ERROR;
				}
				//----Condiciones de cambio de estado
			}
			break;
			case TCP_CONN_ERROR://Error al Conectar a Servidor TCP
			{
				NOP(b);
				if(b->_estado==at_restart)		//Reinicio involuntario de módulo
				{
					Cambiar_CWMODE(b);
					b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX

					b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
				}
				if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
				{
					ConectarWIFI(b);
					b->_estado_conexion=CONEXION_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}

				if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado)||(b->_estado==at_tcp_alrdy_cnntd_err))	//Si se cierra la conexión vuelvo a conectar
				{
					ConectarTCP(b);
					b->_estado_conexion=TCP_CONN_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}
			}
			break;
			case TCP_CONN_OK://Conectar a Servidor TCP OK
			{
				NOP(b);

					if(b->_estado==at_restart)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX

