chelogithub/ESP8266/ESP8266_Chelo.c
						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
					if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
					{
						ConectarWIFI(b);
						b->_estado_conexion=CONEXION_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX
					}
					if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
					{
						ConectarTCP(b);
						b->_estado_conexion=TCP_CONN_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX
					}
					if((b->_estado==at_tcp_alrdy_cnntd_err)||(b->_estado==at_tcp_conectado))
					{
						//OJO SOLO HTTP
						/*EnviarDatos(b);*/
						b->_estado_conexion=TCP_SND_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector Rx
					}
			}
			break;
			case TCP_SND_EN_CURSO:			//Enviar datos a Servidor TCP
			{
				if((b->_estado!=700)&&(b->_estado!=at_error)
									&&(b->_estado!=at_wifi_disconnect)
									&&(b->_estado!=at_tcp_desconectado)
									&&(b->_estado!=at_tcp_snd_err)
									&&(b->_estado!=at_tcp_ok_to_send)
									&&(b->_estado!=at_tcp_enviado_error))	//Si estoy conectando, no vuelvo a conectar.
				{
					//EnviarDatos(b);  SOLO EN HTTP
						if(b->_enviaruart==1)
							{
								b->_estado=AT_ESP8266_ND(b);
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


							}
				}
						if((b->_estado==700)&&(b->_enviaruart==1)
											&&(b->_estado!=at_error)
											&&(b->_estado!=at_wifi_disconnect)
											&&(b->_estado!=at_tcp_desconectado)
											&&(b->_estado!=at_tcp_snd_err)
											&&(b->_estado!=at_tcp_enviado_error))
							{
								b->_enviaruart=0;
								if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
								HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


							}

				//----Condiciones de cambio de estado
				if((b->_estado==at_tcp_enviado_ok)) b->_estado_conexion=TCP_SND_OK;
				if((b->_estado==at_error)||(b->_estado==at_wifi_disconnect)
										 ||(b->_estado==at_tcp_desconectado)
										 ||(b->_estado==at_tcp_snd_err)
										 ||(b->_estado==at_tcp_enviado_error))
					{
					b->_estado_conexion=TCP_SND_ERROR;
					b->_enviaruart==0;		//Si hay error no me arriesgo a que envíe algo
					}
				//----Condiciones de cambio de estado
			}
			break;
			case TCP_SND_ERROR://Error al Enviar datos a Servidor TCP
			{
				NOP(b);
				if(b->_estado==at_restart)		//Reinicio involuntario de módulo
				{
					Cambiar_CWMODE(b);
					b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX

					b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
				}
				if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
				{
					ConectarWIFI(b);
					b->_estado_conexion=CONEXION_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}

				if((b->_estado==at_wifi_gotip))	//220130 Si se cayó la conexion y vuelve a conectar, que conecte TCP nuevamente
				{
					ConectarTCP(b);
					b->_estado_conexion=TCP_CONN_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}

				if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado)
										 ||(b->_estado==at_tcp_snd_err)
										 ||(b->_estado==at_tcp_enviado_error))	//Si se cierra la conexión vuelvo a conectar
				{
					ConectarTCP(b);
					b->_estado_conexion=TCP_CONN_EN_CURSO;
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
				}
			}
			break;
			case TCP_SND_OK://Enviar datos a Servidor TCP OK
			{
				NOP(b);

					if(b->_estado==at_restart)		//Reinicio involuntario de módulo
					{
						Cambiar_CWMODE(b);
						b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX

						b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
					}
					if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
					{
						ConectarWIFI(b);
						b->_estado_conexion=CONEXION_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX
					}
					if((b->_estado==at_error)||(b->_estado==at_wifi_connected)||(b->_estado==at_wifi_gotip)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
					{
						ConectarTCP(b);
						b->_estado_conexion=TCP_CONN_EN_CURSO;
						b->_estado=0;
						b->_n_orig=0; //Borro el vector RX
					}
					//EVITO EL REENVÍO PERMANENTE CON CLIENTE TCO, SOLO BAJO DEMANDA
					/*HAL_Delay(200);
					EnviarDatos(b);
					b->_estado_conexion=TCP_SND_EN_CURSO;*/
					b->_estado_conexion=TCP_CONN_OK; //AGREGADO PARA HTTP
					b->_estado=0;
					b->_n_orig=0; //Borro el vector RX
			}
			break;
			case TCP_SRVR_EN_CURSO:			//Conectar Servidor TCP local
						{
							if((b->_estado!=800)&&(b->_estado!=at_error)&&(b->_estado!=at_wifi_disconnect)&&(b->_estado!=21)&&(b->_estado!=22)&&(b->_estado!=23))	//Si estoy conectando, no vuelvo a conectar.
							{
								CrearServidorTCP(b);
									if(b->_enviaruart==1)
										{
											b->_estado=AT_ESP8266_ND(b);
											b->_enviaruart=0;
											if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
											HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


										}
							}

							//----Condiciones de cambio de estado
							if((b->_estado==21)||(b->_estado==23)) b->_estado_conexion=TCP_SRVR_OK;
							if((b->_estado==22)) b->_estado_conexion=TCP_SRVR_ERROR;
							//----Condiciones de cambio de estado
						}
						break;
						case TCP_SRVR_ERROR://Error al Conectar Servidor TCP local
						{
							NOP(b);
							if(b->_estado==at_restart)		//Reinicio involuntario de módulo
							{
								Cambiar_CWMODE(b);
								b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX

