chelogithub/ESP8266/ESP8266_Chelo.c
								b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
							}
							if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
							{
								ConectarWIFI(b);
								b->_estado_conexion=CONEXION_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
							{
								ConectarTCP(b);
								b->_estado_conexion=TCP_CONN_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}
//220818
/*							if(b->_estado==at_tcp_srvr_err)//		//Reinicio involuntario de módulo
							{//
								Cambiar_CWMODE(b);//
								b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;//
								b->_estado=0;//
								b->_n_orig=0;// //Borro el vector RX

								b->_TCP_Local_Server_Initiated=0;//	//Indico servidor debe ser iniciado
							}*/

						}
						break;
						case TCP_SRVR_CLIENT_DSCNN://Error Conectar Servidor TCP local
						{
							NOP(b);
							if(b->_estado==at_restart)		//Reinicio involuntario de módulo
							{
								Cambiar_CWMODE(b);
								b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX

								b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
							}
							if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
							{
								ConectarWIFI(b);
								b->_estado_conexion=CONEXION_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
							{
								ConectarTCP(b);
								b->_estado_conexion=TCP_CONN_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}
						}
						break;
						case TCP_SRVR_CLIENT_RX://Error al Conectar Servidor TCP local
						{
							NOP(b);
							if(b->_estado==at_restart)		//Reinicio involuntario de módulo
							{
								Cambiar_CWMODE(b);
								b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX

								b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
							}
							if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
							{
								ConectarWIFI(b);
								b->_estado_conexion=CONEXION_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
							{
								ConectarTCP(b);
								b->_estado_conexion=TCP_CONN_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}
						}
						break;
						case TCP_SRVR_CLIENT_CNN://Error al Conectar Servidor TCP local
						{
							NOP(b);
							if(b->_estado==at_restart)		//Reinicio involuntario de módulo
							{
								Cambiar_CWMODE(b);
								b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX

								b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
							}
							if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
							{
								ConectarWIFI(b);
								b->_estado_conexion=CONEXION_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
							{
								ConectarTCP(b);
								b->_estado_conexion=TCP_CONN_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}
						}
						break;
						case TCP_SRVR_OK://Conectar Servidor TCP local OK
						{
							NOP(b);
								b->_TCP_Local_Server_Initiated=1;

								if(b->_estado==at_restart)		//Reinicio involuntario de módulo
								{
									Cambiar_CWMODE(b);
									b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX

									b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
								}
								if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
								{
									ConectarWIFI(b);
									b->_estado_conexion=CONEXION_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
								}
								if((b->_estado==at_error)||(b->_estado==at_tcp_desconectado))	//Si se cierra la conexión vuelvo a conectar
								{
									ConectarTCP(b);
									b->_estado_conexion=TCP_CONN_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
								}
								if(((b->_estado==at_tcp_alrdy_cnntd_err)||(b->_estado==at_tcp_conectado)) && ModBUS_Check(b->_data2SND,b->_n_D2SND))//if((b->_estado==at_tcp_alrdy_cnntd_err)||(b->_estado==at_tcp_conectado))
								{
									EnviarDatosSRVR(b);
									b->_estado_conexion=TCP_SRVR_TX_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
								}
								if(b->_send_data==1) // SOLO HTTP     if((b->_send_data==1)&& ModBUS_Check(b->_data2SND,b->_n_D2SND))
								{
									EnviarDatosSRVR(b);
									b->_estado_conexion=TCP_SRVR_TX_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
									b->_send_data==0;//b->_new_data_rcv=0; 220219
								}
						}
						break;

						case TCP_SRVR_TX_EN_CURSO:			//Enviar datos desde Servidor TCP
						{
							if((b->_estado!=900)&&(b->_estado!=at_error)&&
							   (b->_estado!=at_wifi_disconnect)&&
							   (b->_estado!=at_wifi_connected)&&
							   (b->_estado!=at_wifi_gotip)&&
							   (b->_estado!=at_tcp_desconectado)&&
							   (b->_estado!=at_tcp_snd_err)&&
							   (b->_estado!=at_tcp_enviado_error)&&
							   (b->_estado!=at_tcp_enviado_ok)&&
							   (b->_estado!=22)&&(b->_estado!=25))//210630 Se agrega 11 y 12 //Se agrega 22 y 25, conexion cerrada y errore de serverif((b->_estado!=900)&&(b->_estado!=2)&&(b->_estado!=at_wifi_disconnect)&&(b->_estado!=at_tcp_desconectado)&&(b->_estado!=at_tcp_snd_err)&&(b->_estado!=at_tcp_enviado_error)&&(b->_estado!=at_tcp_enviado_ok))	//Si estoy conectando, no vuelvo a conectar.
							{
								EnviarDatosSRVR(b);
									if(b->_enviaruart==1)
										{
											b->_estado=AT_ESP8266_ND(b);
											b->_enviaruart=0;
											if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
											HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


