chelogithub/ESP8266/ESP8266_Chelo.c
										}
							}
									if((b->_estado==900)&&(b->_enviaruart==1)&&
									   (b->_estado!=at_error)&&
									   (b->_estado!=at_wifi_disconnect)&&
									   (b->_estado!=at_wifi_connected)&&
									   (b->_estado!=at_wifi_gotip)&&
									   (b->_estado!=at_tcp_desconectado)&&
									   (b->_estado!=at_tcp_snd_err)&&
									   (b->_estado!=at_tcp_enviado_error)&&
									   (b->_estado!=at_tcp_enviado_ok)&&
									   (b->_estado!=22)&&(b->_estado!=25))//210630 Se agrega 11 y 12 //
										{
											b->_enviaruart=0;
											if (EN_DEBUG==1) ITM0_Write((uint8_t*)b->_uart2snd, b->_n_uart2SND); //210915
											HAL_UART_Transmit(PORTSER,(uint8_t*)b->_uart2snd, b->_n_uart2SND,100);


										}

							//----Condiciones de cambio de estado
							if((b->_estado==at_tcp_enviado_ok)) b->_estado_conexion=TCP_SRVR_TX_OK;
							if((b->_estado==at_error)||(b->_estado==at_restart)||
							   (b->_estado==at_wifi_disconnect)||(b->_estado==at_wifi_connected)||
							   (b->_estado==at_wifi_gotip)||(b->_estado==at_tcp_desconectado)||
							   (b->_estado==at_tcp_snd_err)||(b->_estado==at_tcp_enviado_error)||
							   (b->_estado==22)||(b->_estado==25))//210630 Se agrega ATDecode 4, 11 y 12
								{
								b->_estado_conexion=TCP_SRVR_TX_ERROR;
								b->_enviaruart==0;		//Si hay error no me arriesgo a que envíe algo
								}
							//----Condiciones de cambio de estado
						}
						break;
						case TCP_SRVR_TX_ERROR://Error al Enviar datos a Servidor TCP
						{
							NOP(b);
							if((b->_estado==at_restart)||(b->_estado==at_wifi_connected)||(b->_estado==at_wifi_gotip))	//210630 Si se reconecta a este nivel hay que resetear		//Reinicio involuntario de módulo
							{
								Cambiar_CWMODE(b);
								b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX

								b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado
							}
							if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
							{
								ConectarWIFI(b);
								b->_estado_conexion=CONEXION_EN_CURSO;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if(b->_estado==22)		//Error con el Servidor TCP
							{
								b->_estado_conexion=TCP_SRVR_ERROR;
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if(b->_estado==24)		//Se conecta nuevamente el cliente
							{
								b->_estado_conexion=TCP_SRVR_OK;  //Listo para enviar datos
								b->_estado=0;
								b->_n_orig=0; //Borro el vector RX
							}

							if((b->_estado==25)||(b->_estado==at_tcp_snd_err)||(b->_estado=at_tcp_enviado_error))		//Desconexion del cliente o error al enviar vuelvo al proceso de envío
							{
								if(b->_new_data_rcv==1) //Vuelvo a enviar solo cuando recibo nuevos datos
								{
									b->_estado_conexion=TCP_SRVR_TX_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
								}

							}


						}
						break;
						case TCP_SRVR_TX_OK://Enviar datos a Servidor TCP OK
						{
							NOP(b);

								if((b->_estado==at_restart)||(b->_estado==at_wifi_connected)||(b->_estado==at_wifi_gotip))	//210630 Si se reconecta a este nivel hay que resetear	//Reinicio involuntario de módulo
								{
									Cambiar_CWMODE(b);
									b->_estado_conexion=CAMBIAR_MODO_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX

									b->_TCP_Local_Server_Initiated=0;	//Indico servidor debe ser iniciado

								}
								if((b->_estado==at_wifi_disconnect)||(b->_estado==at_deconectar_ok )) //Si me desconecto, me vuelvo a conectar
								{
									ConectarWIFI(b);
									b->_estado_conexion=CONEXION_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
								}

								if(((b->_new_data_rcv==1)||(b->_send_data==1))) // OJO SOLO CON HTTP if(((b->_new_data_rcv==1)||(b->_send_data==1))&& ModBUS_Check(b->_data2SND,b->_n_D2SND))
								{
									/*if(b->_data2SND[10]==100)
									{
										b->_data2SND[10]=0x00;
									}
									b->_data2SND[10]++;*/
									EnviarDatosSRVR(b);
									b->_estado_conexion=TCP_SRVR_TX_EN_CURSO;
									b->_estado=0;
									b->_n_orig=0; //Borro el vector RX
									b->_new_data_rcv=0;
//220818
									b->_send_data=0;
								}

						}
						break;

		}
		return(b->_estado_conexion);
	}
		//--------------Maquina de estados para conectar a TCP

